app/views/reservations/_reservation_row.html.erb

  <td class="py-2 px-4 border-b">
    <% user = User.find_by(id: reservation_row.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]