app/controllers/authentication/sessions_controller.rb

SELECT "users".* FROM "users" WHERE (email = 'bryanAndrade' OR username = 'bryanAndrade') LIMIT $1  [["LIMIT", 1]]
---
    def create
        @user = User.find_by('email = :login OR username = :login', {login: params[:login]})