app/controllers/cars_controller.rb

  def index
    @types = Type.order(name: :asc)
---
SELECT "types".* FROM "types" ORDER BY "types"."name" ASC