app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1  [["user_id", 1]]
---
    def index
        @reservations = Reservation.all
        @user_reservations = Reservation.where(user_id: Current.user.id)