app/views/cars/new.html.erb

                <%= form.label :type, "Tipo de auto", class: "block mb-2 text-sm font-medium text-gray-600" %>
                <%= form.collection_select :type_id, Type.all.order(name: :asc), :id, :name, { prompt: "Seleccione un tipo" }, { class: "text-sm rounded-lg block w-full p-2.5 bg-zinc-800 text-white" } %>
---
SELECT "types".* FROM "types" ORDER BY "types"."name" ASC